In [1]:
import pandas as pd
# pd.set_option('display.max_rows', None)
# pd.set_option('display.max_columns', None)
pd.set_option('max_colwidth',0)

In [25]:
import pandas as pd
import datetime
import pandas_datareader.data as web
from pandas import Series, DataFrame


start = datetime.datetime(2010, 1, 1)
end = datetime.datetime(2017, 1, 11)

df = web.DataReader("AAPL", 'yahoo', start, end)
df.tail()

                 High        Low       Open      Close       Volume  Adj Close
Date
2017-01-05  29.215000  28.952499  28.980000  29.152500  88774400.0   27.365599
2017-01-06  29.540001  29.117500  29.195000  29.477501  127007600.0  27.670673
2017-01-09  29.857500  29.485001  29.487499  29.747499  134247600.0  27.924122
2017-01-10  29.844999  29.575001  29.692499  29.777500  97848400.0   27.952286
2017-01-11  29.982500  29.650000  29.684999  29.937500  110354400.0  28.102478

In [26]:
df.describe()

,High,Low,Open,Close,Volume,Adj Close
count,1770.000000,1770.000000,1770.000000,1770.000000,1.770000e+03,1770.000000
mean,20.065614,19.690883,19.887280,19.881663,3.758375e+08,17.710494
std,7.155103,7.042748,7.099451,7.098425,2.408629e+08,6.754106
min,7.000000,6.794643,6.870357,6.858929,4.590360e+07,5.864508
25%,13.985179,13.711607,13.857946,13.886071,1.958096e+08,11.872840
50%,19.888215,19.457679,19.766429,19.678572,3.218838e+08,17.239652
75%,26.338126,25.763124,26.012500,26.076874,4.836405e+08,23.874288
max,33.634998,32.849998,33.615002,33.250000,1.880998e+09,30.160797

# Pandas Groupby

In [2]:
df_student = pd.read_csv('resources/pandas_exercise_student.csv',index_col=0)

In [3]:
df_student

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

## Exercise 1
Group the dataframe based on school code and get mean, min, and max value of age for each school.

In [5]:
print('\nMean, min, and max value of age for each value of the school:')
grouped_single = df_student.groupby('school_code').agg({'age': ['mean', 'min', 'max']})
print(grouped_single)

Mean, min, and max value of age for each value of the school:
              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

## Exercise 3

Write a Pandas program to split the following given dataframe into groups based on school code and class.

In [7]:
result = df_student.groupby(['school_code', 'class'])

## Exercise 3
Write a Pandas program to split the following given dataframe into groups based on school code and call a specific group with the name of the group.

In [18]:
grouped = df_student.groupby(['school_code'])
print(grouped.get_group('s001'))

   school_code class            name date_Of_Birth   age  height  weight  \
S1  s001        V     Alberto Franco  15/05/2002     12   173     35
S4  s001        VI    Eesha Hinton    25/09/1998     13   167     30

    address
S1  street1
S4  street1

## Exercise 7

Write a Pandas program to split a dataset, **group by one column and get mean, min, and max values by group**. 


For example, Using the following dataset **find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).**

In [20]:
import pandas as pd
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
orders_data = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

orders_data

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001   150.50     2012-10-05  3005         5002
1   70009   270.65     2012-09-10  3001         5005
2   70002   65.26      2012-10-05  3002         5001
3   70004   110.50     2012-08-17  3009         5003
4   70007   948.50     2012-09-10  3005         5002
5   70005   2400.60    2012-07-27  3007         5001
6   70008   5760.00    2012-09-10  3002         5001
7   70010   1983.43    2012-10-10  3004         5006
8   70003   2480.40    2012-10-10  3009         5003
9   70012   250.45     2012-06-27  3008         5002
10  70011   75.29      2012-08-17  3003         5007
11  70013   3045.60    2012-04-25  3002         5001

In [23]:
result = orders_data.groupby('customer_id').agg({'purch_amt': ['mean', 'min', 'max']})
result

               purch_amt
                    mean      min      max
customer_id
3001         270.650000   270.65   270.65
3002         2956.953333  65.26    5760.00
3003         75.290000    75.29    75.29
3004         1983.430000  1983.43  1983.43
3005         549.500000   150.50   948.50
3007         2400.600000  2400.60  2400.60
3008         250.450000   250.45   250.45
3009         1295.450000  110.50   2480.40

## Exercise 8 
Write a Pandas program to split a dataset to group by two columns and count by each row.

In [28]:
print("\nGroup by two columns and count by each row:")
result = orders_data.groupby(['salesman_id','customer_id']).size().reset_index().groupby(['salesman_id','customer_id'])[[0]].max()
result

Group by two columns and count by each row:

                         0
salesman_id customer_id
5001        3002         3
            3007         1
5002        3005         2
            3008         1
5003        3009         2
5005        3001         1
5006        3004         1
5007        3003         1

## Exercise 9 

Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups.

In the following dataset **group on** 'customer_id', 'salesman_id' and then **sort** sum of purch_amt within the groups

In [30]:
df_agg = orders_data.groupby(['customer_id','salesman_id']).agg({'purch_amt':sum})
result = df_agg['purch_amt'].groupby(level=0, group_keys=False)
print(result.nlargest())

Group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups:
customer_id  salesman_id
3001         5005           270.65
3002         5001           8870.86
3003         5007           75.29
3004         5006           1983.43
3005         5002           1099.00
3007         5001           2400.60
3008         5002           250.45
3009         5003           2590.90
Name: purch_amt, dtype: float64

## Exercise 11

Write a Pandas program to split the following dataframe into groups and calculate monthly purchase amount.

In [33]:
orders_data['ord_date']= pd.to_datetime(orders_data['ord_date']) 
result = orders_data.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})
print(result)

            purch_amt
ord_date
2012-04-30  3045.60
2012-05-31  0.00
2012-06-30  250.45
2012-07-31  2400.60
2012-08-31  185.79
2012-09-30  6979.15
2012-10-31  4679.59

## Exercise 13

Write a Pandas program to split the following datasets into groups on customer id and calculate the number of customers starting with 'C', the list of all products and the difference of maximum purchase amount and minimum purchase amount

In [39]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2012','08-17-2012','10-09-2012','07-27-2012','10-09-2012','10-10-2012','10-10-2012','06-17-2012','07-08-2012','04-25-2012'],
'customer_id':['C3001','C3001','D3005','D3001','C3005','D3001','C3005','D3001','D3005','C3001','D3005','D3005'],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

print(df)

    ord_no  purch_amt    ord_date customer_id  salesman_id
0   70001   150.50     05-10-2012  C3001       5002
1   70009   270.65     09-10-2012  C3001       5005
2   70002   65.26      05-10-2012  D3005       5001
3   70004   110.50     08-17-2012  D3001       5003
4   70007   948.50     10-09-2012  C3005       5002
5   70005   2400.60    07-27-2012  D3001       5001
6   70008   5760.00    10-09-2012  C3005       5001
7   70010   1983.43    10-10-2012  D3001       5006
8   70003   2480.40    10-10-2012  D3005       5003
9   70012   250.45     06-17-2012  C3001       5002
10  70011   75.29      07-08-2012  D3005       5007
11  70013   3045.60    04-25-2012  D3005       5001

In [40]:
def customer_id_C(x):
    return (x.str[0] == 'C').sum()
result = df.groupby(['salesman_id'])\
  .agg(customer_id_start_C = ('customer_id', customer_id_C),
       customer_id_list = ('customer_id', lambda x: ', '.join(x)),
       purchase_amt_gap   = ('purch_amt', lambda x: x.max()-x.min())
      )
print(result)

             customer_id_start_C            customer_id_list  purchase_amt_gap
salesman_id
5001         1                    D3005, D3001, C3005, D3005  5694.74
5002         3                    C3001, C3005, C3001         798.00
5003         0                    D3001, D3005                2369.90
5005         1                    C3001                       0.00
5006         0                    D3001                       0.00
5007         0                    D3005                       0.00

## Exercise 14

Write a Pandas program to split a given dataset, group by one column and apply an aggregate function to few columns and another aggregate function to the rest of the columns of the dataframe.

In [44]:
import pandas as pd
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
df = pd.read_csv("resources/sales_dataset.csv")

df.head()

,salesman_id,sale_jan,sale_feb,sale_mar,sale_apr,sale_may,sale_jun,sale_jul,sale_aug,sale_sep,sale_oct,sale_nov,sale_dec
0,5002,150.50,250.50,150.50,150.50,130.50,150.50,950.50,150.50,150.50,150.50,150.50,150.50
1,5005,270.65,170.65,270.65,270.65,270.65,270.65,270.65,70.65,270.65,270.65,270.65,70.65
2,5001,65.26,15.26,65.26,95.26,65.26,45.26,65.26,65.26,65.26,65.26,95.26,65.26
3,5003,110.50,110.50,110.50,210.50,310.50,110.50,210.50,110.50,110.50,110.50,110.50,110.50
4,5002,948.50,598.50,948.50,948.50,948.50,948.50,948.50,948.50,948.50,948.50,948.50,948.50

In [46]:
df = df.groupby('salesman_id').agg(lambda x : x.sum() if x.name in ['sale_jan','sale_feb','sale_mar'] else x.mean())
df

,sale_jan,sale_feb,sale_mar,sale_apr,sale_may,sale_jun,sale_jul,sale_aug,sale_sep,sale_oct,sale_nov,sale_dec
salesman_id,,,,,,,,,,,,
5001,5271.46,7221.46,11271.46,1575.365000,1567.865,3062.865000,2817.865000,2317.865000,2267.865000,2817.865000,2825.365000,2817.865000
5002,2349.45,1099.45,1349.45,449.816667,443.150,449.816667,716.483333,449.816667,449.816667,449.816667,449.816667,449.816667
5003,590.90,2590.90,2590.90,1345.450000,1395.450,1295.450000,1345.450000,1295.450000,1295.450000,1295.450000,1295.450000,1295.450000
5005,270.65,170.65,270.65,270.650000,270.650,270.650000,270.650000,70.650000,270.650000,270.650000,270.650000,70.650000
5006,2983.43,1983.43,1983.43,1983.430000,1983.430,983.430000,983.430000,1983.430000,1983.430000,1983.430000,1983.430000,1983.430000
5007,75.29,75.29,75.29,75.290000,75.290,75.290000,75.290000,75.290000,75.290000,75.290000,75.290000,75.290000

# join two dataframes along rows

## Exercise 1
Write a Pandas program to join the two given dataframes **along rows** and assign all data using pd.concat.

In [48]:
import pandas as pd

student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

result_data = pd.concat([student_data1, student_data2])
result_data

  student_id              name  marks
0  S1         Danniella Fenton  200
1  S2         Ryder Storey      210
2  S3         Bryce Jensen      190
3  S4         Ed Bernal         222
4  S5         Kwame Morin       199
0  S4         Scarlette Fisher  201
1  S5         Carla Williamson  200
2  S6         Dante Morse       198
3  S7         Kaiser William    219
4  S8         Madeeha Preston   201

## Exercise 2
Join two dataframes **along columns**

In [50]:
result_data = pd.concat([student_data1, student_data2], axis = 1)
result_data

  student_id              name  marks student_id              name  marks
0  S1         Danniella Fenton  200    S4         Scarlette Fisher  201
1  S2         Ryder Storey      210    S5         Carla Williamson  200
2  S3         Bryce Jensen      190    S6         Dante Morse       198
3  S4         Ed Bernal         222    S7         Kaiser William    219
4  S5         Kwame Morin       199    S8         Madeeha Preston   201

## Exercise 4

Write a Pandas program to join the two given dataframes along rows and merge with another dataframe along the common column id.

In [51]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})


print("\nJoin first two said dataframes along rows:")
result_data = pd.concat([student_data1, student_data2])
print(result_data)

print("\nNow join the said result_data and df_exam_data along student_id:")
final_merged_data = pd.merge(result_data, exam_data, on='student_id')
final_merged_data

Join first two said dataframes along rows:
  student_id              name  marks
0  S1         Danniella Fenton  200
1  S2         Ryder Storey      210
2  S3         Bryce Jensen      190
3  S4         Ed Bernal         222
4  S5         Kwame Morin       199
0  S4         Scarlette Fisher  201
1  S5         Carla Williamson  200
2  S6         Dante Morse       198
3  S7         Kaiser William    219
4  S8         Madeeha Preston   201

Now join the said result_data and df_exam_data along student_id:

  student_id              name  marks  exam_id
0  S1         Danniella Fenton  200    23
1  S2         Ryder Storey      210    45
2  S3         Bryce Jensen      190    12
3  S4         Ed Bernal         222    67
4  S4         Scarlette Fisher  201    67
5  S5         Kwame Morin       199    21
6  S5         Carla Williamson  200    21
7  S7         Kaiser William    219    55
8  S8         Madeeha Preston   201    33

## Exercise 5
Write a Pandas program to join the two dataframes using the common column of both dataframes.

In [52]:
merged_data = pd.merge(student_data1, student_data2, on='student_id', how='inner')
print("Merged data (inner join):")
merged_data

Merged data (inner join):

  student_id       name_x  marks_x            name_y  marks_y
0  S4         Ed Bernal    222      Scarlette Fisher  201
1  S5         Kwame Morin  199      Carla Williamson  200

## Exercise 6

Write a Pandas program to join the two dataframes with matching records from both sides where available. Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only.

In [53]:
merged_data = pd.merge(student_data1, student_data2, on='student_id', how='outer')
print("Merged data (outer join):")
merged_data

Merged data (outer join):

  student_id            name_x  marks_x            name_y  marks_y
0  S1         Danniella Fenton  200.0    NaN              NaN
1  S2         Ryder Storey      210.0    NaN              NaN
2  S3         Bryce Jensen      190.0    NaN              NaN
3  S4         Ed Bernal         222.0    Scarlette Fisher  201.0
4  S5         Kwame Morin       199.0    Carla Williamson  200.0
5  S6         NaN              NaN       Dante Morse       198.0
6  S7         NaN              NaN       Kaiser William    219.0
7  S8         NaN              NaN       Madeeha Preston   201.0

In [56]:
student_data1

  student_id              name  marks
0  S1         Danniella Fenton  200
1  S2         Ryder Storey      210
2  S3         Bryce Jensen      190
3  S4         Ed Bernal         222
4  S5         Kwame Morin       199

In [58]:
student_data2

  student_id              name  marks
0  S4         Scarlette Fisher  201
1  S5         Carla Williamson  200
2  S6         Dante Morse       198
3  S7         Kaiser William    219
4  S8         Madeeha Preston   201

In [55]:
merged_data = pd.merge(student_data1, student_data2, how='left', on=['student_id', 'name'])
print(merged_data)
print("\nMerged Data (keys from data2):")
merged_data = pd.merge(student_data1, student_data2, how='left', on=['student_id', 'name'])
print(merged_data)

KeyError: 'key1'

# Healthcare dataset

read csv files named 
raw_data.csv, 29_dec_healthcare_new.csv 
MT_data_from_raw - covid_faq.csv from resources folder

In [15]:
df_raw = pd.read_csv('resources/raw_data.csv')
df_healthcare = pd.read_csv('29_dec_healthcare_new.csv')
df_covid = pd.read_csv('MT_data_from_raw - covid_faq.csv')

In [24]:
df_healthcare

,0,idx
0,သွေးတိုး ကျ စေ တယ်,idx_new_health_0
1,ဆီးချို တိုင်း ကြည့် ပါ,idx_new_health_1
2,ဆီးချို အတွက် ဆေး လား,idx_new_health_2
3,သွေးတိုး နေ လို့ ပါ,idx_new_health_3
4,ဆီးချို ကို လဲ ကျ စေ တယ်,idx_new_health_4
...,...,...
691,၀က်တစ်သျှူး လို အရာ တွေ က တော့ လက် ကို သုတ် မယ့် အစား ပစ္စည်း တွေ ကို သန့်ရှင်းရေး လုပ် ဖို့ လောက် ပဲ သင့်တော် ပါ တယ် တဲ့,idx_new_health_313
692,ကိုရိုနာ ဗိုင်းရပ်စ် ကူးစက် ခံ ရ သော ကလေး များ တွင် အူလမ်းကြောင်း ဆိုင်ရာ ဝေဒနာ များ မျက်စိ နဲ့ နှလုံး ရောဂါ သွေးကြော နံရံ များ ရောင်ရမ်း ခြင်း နဲ့ သွေးဆိပ် တက် ရော,idx_new_health_314
693,ချက်ချင်း လျှော် ပါ,idx_new_health_315
694,သေချာ အခြောက်ခံ ပါ,idx_new_health_316
695,အဝတ် တွေ ကို ခါ တာ မျိုး မ လုပ် ပါ နဲ့ ပိုး တွေ ပြန့် သွား နိုင် လို့ ပါ,idx_new_health_317

## make all csv with the same column names and index. Then combine them.

## drop nan rows and duplicate rows

## Split the sentences with "\n and ။"

## Get sentence length of each rows

## remove punctuations from sentences

## lower all english sentences

## get sentences with covid keywords

## get sentences with burmese end words